reddit_clone/app/views/posts/_form.html.erb

SELECT  1 AS one FROM "post_subs" WHERE "post_subs"."post_id" IS NULL AND "post_subs"."sub_id" = $1 LIMIT $2  [["sub_id", 1], ["LIMIT", 1]]
SELECT "subs"."id" FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 3]]
---
                  value="<%= sub.id %>"
                  <%= "checked" if @post.sub_ids.include?(sub.id) %> />