reddit_clone/app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "author_id", "post_id", "parent_comment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "Blah blah blah child2"], ["author_id", 1], ["post_id", 3], ["parent_comment_id", 1], ["created_at", "2019-11-11 21:38:41.711966"], ["updated_at", "2019-11-11 21:38:41.711966"]]
---
    def create
        @comment = Comment.new(comment_params)
        @comment.author_id = current_user.id
        if @comment.save