reddit_clone/app/controllers/posts_controller.rb

    def ensure_user_is_author
        @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def new
        @post = Post.new
        @subs = Sub.all
---
SELECT "subs".* FROM "subs"

    def create
        @post = Post.new(post_params)
        @post.author_id = current_user.id
        @subs = Sub.all

        if @post.save
---
SELECT "subs".* FROM "subs"
INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def show
        @post = Post.find(params[:id])
        @author = User.find(@post.author_id)
        # @comments = @post.comments.where(parent_comment_id: nil)
        @all_comments = @post.comments.includes(:author)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]

    def edit
        @post = Post.find(params[:id])
        @subs = Sub.all
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "subs".* FROM "subs"

    def update
        @post = Post.find(params[:id])
        @subs = Sub.all
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "subs".* FROM "subs" WHERE 1=0