reddit_clone/app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def ensure_user_is_moderator
        @sub = Sub.find(params[:id])

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", ""], ["updated_at", "2019-11-11 17:10:27.303973"], ["id", 1]]
---
    def update
        @sub = Sub.find(params[:id])

        if @sub.update_attributes(sub_params)